list_A = ['杜楷辉', '翟石城', '洪颖', '龙琴', '蔡阳', '胡雨仙子', '吴珍珍', '谭圆', '薛威', '周慧欣', '石瑞', '向申赤', '赵小芹', '胡国昌', '徐雅琪', '李淳', '陈熠豪', '彭嘉欣', '张雷', '万兰新', '赵习媛', '马诗敏', '杜俞锋', '夏森杰', '杨千蕊', '李元丹', '吴远炀', '戴润东', '黄籽越', '田瑞琨', '王子雄', '刘珂霖', '舒锐']
list_B = ['万兰新', '李元丹', '贾高清', '杨烜', '张雷', '刘珂霖', '翟石城', '田瑞琨', '马诗敏', '彭嘉欣', '陈熠豪', '徐雅琪', '石瑞', '王子雄', '吴远炀', '张梓译', '李淳', '杜楷辉', '向申赤', '艾克拜尔.图荪巴克尔', '周慧欣', '戴润东', '杜俞锋', '杨千蕊', '陈亚冉', '胡国昌', '赵小芹', '朱亮亮', '吴珍珍', '黄籽越', '胡雨仙子', '蔡阳', '洪颖', '曹中柱', '舒锐', '李亚楠', '夏森杰', '赵习媛', '龙琴', '谭圆', '薛威', '段琪']

set_A = set(list_A)
set_B = set(list_B)

result = set_B - set_A
print(list(result))